Revit 2026 API

# CylindricalHelixHeight Property

---

Height of the cylindrical helix.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Height { get; }
```
```vb
Public ReadOnly Property Height As Double
	Get
```
```cpp
public:
property double Height {
	double get ();
}
```
```fsharp
member Height : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | Height is not defined for unbounded helix. |

It is the length of the span of the helix along the axis direction. The height is defined only if the helix is bounded. That is, its start and end angles (parameters) are specified.

#### Reference

CylindricalHelix Class

Autodesk.Revit.DB Namespace